IDENTIFICATION DIVISION.
PROGRAM-ID. AVERAGE_GRADE_CALC.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT GRADES_FILE ASSIGN TO "GRADE_FILE.TXT"
ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD GRADES_FILE.
01 GRADE_RECORD.
    05 GRADE PIC 9.

WORKING-STORAGE SECTION.
01 TOTAL_GRADES PIC 9 VALUE ZEROS.
01 COUNT PIC 9 VALUE ZEROS.
01 AVERAGE_GRADE PIC 9.99 VALUE ZEROS.

PROCEDURE DIVISION.
    OPEN INPUT GRADES_FILE
    PERFORM UNTIL END-OF-FILE
        READ GRADES_FILE
        AT END MOVE ZEROS TO GRADE
        END-READ
        IF GRADE NOT EQUAL TO ZEROS
            ADD GRADE TO TOTAL_GRADES
            ADD 1 TO COUNT
        END-IF
    END-PERFORM
    COMPUTE AVERAGE_GRADE = TOTAL_GRADES / COUNT
    DISPLAY AVERAGE_GRADE
    CLOSE GRADES_FILE
    STOP RUN.
